tutorials/LES/3DChannel560/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 0.02;

vertices
(
    (0     0 0)     //0
    (6.283 0 0)     //1
    (0     1 0)     //2
    (6.283 1 0)     //3
    (0     2 0)     //4
    (6.283 2 0)     //5
    (0     0 3.142) //6
    (6.283 0 3.142) //7
    (0     1 3.142) //8
    (6.283 1 3.142) //9
    (0     2 3.142) //10
    (6.283 2 3.142) //11
);

blocks
(
    hex (0 1 3 2 6 7 9 8) (100 40 80) simpleGrading (1 6.06 1)
    hex (2 3 5 4 8 9 11 10) (100 40 80) simpleGrading (1 0.165 1)
);

edges
(
);

boundary
(
    bottomWall
    {
        type            wall;
        faces           ((0 1 7 6));
    }
    topWall
    {
        type            wall;
        faces           ((4 10 11 5));
    }

    left
    {
        type            cyclic;
        neighbourPatch  right;
        faces           ((0 2 3 1)
                         (2 4 5 3));
    }
    right
    {
        type            cyclic;
        neighbourPatch  left;
        faces           ((6 7 9 8)
                         (8 9 11 10));
    }
    outlet
    {
        type            cyclic;
        neighbourPatch  inlet;
        faces           ((1 3 9 7)
                         (3 5 11 9));
    }
    inlet
    {
        type            cyclic;
        neighbourPatch  outlet;
        faces           ((0 6 8 2)
                         (2 8 10 4));
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
